{
  "auto_map": {
    "AutoConfig": "configuration_jina_embeddings_v5.JinaEmbeddingsV5Config",
    "AutoModel": "modeling_jina_embeddings_v5.JinaEmbeddingsV5Model"
  },
  "architectures": [
    "JinaEmbeddingsV5Model"
  ],
  "task_names": ["retrieval", "text-matching", "clustering", "classification"],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "max_position_embeddings": 32768,
  "max_window_layers": 28,
  "model_type": "jina_embeddings_v5",
  "num_attention_heads": 16,
  "num_hidden_layers": 28,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 3500000,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.0",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}